# 4. Написать программу, которая находит наибольшее из трех чисел.

num1 = float(input()) # вводим первое число
num2 = float(input()) #вводим второе число
num3 = float(input()) #вводим третье число
print(max(num1, num2, num3)) # выводим максимальное число из трёх