# 7. Вывести таблицу умножения на 9.

for i in range(1, 11): # создаём цикл 10 итераций
    print(f'{i} x 9 = {i * 9}') # выводим результат