#9. Реализовать функцию возведения числа в степень.

num = float(input()) # введите число
z = int(input()) #введите степень
print(num**z) #выводим результат